src/cf/Enums/ТипыЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПередОзнакомлениемДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияБыстрый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТегиHtmlПриНачалеСогласованияДолгий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьУдалитьЗаполняемыйПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоЗадачеЭлемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапускОбработкиПоОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияВложенного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПослеВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаршрутизацияКомплексногоПроцессаПоСхемеПослеПродолжения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияИсполненияПроцессами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессамиНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачатьВыполнениеДействияСогласованияПроцессомНовыеУчастники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьHtmlПередОзнакомлением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДанныеЗадачПоЗамещению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьДействиеОзнакомленияЦеликомЕслиНужно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПоСостояниюДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуПриПеренаправлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьЗадачуУчастникаМассовогоОзнакомления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьОбработкуОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновитьПроцессБезДействия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработатьИзменениеКонтейнеровДля2ФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВыполнениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьПринятиеКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПерейтиКВыполнениюДействияВнеОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренаправлениеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносСрокаВыполненияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовитьПредметКСогласованиюВРежимеЗамечаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаОзнакомленияСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрерватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьКИсполнениюЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьВыполнениеОбработкиПослеЗавершенияОзнакомленияСОжиданием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьОбработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьHtmlПриНачалеСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СохранитьРезультатВыполненияВЗадачуПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтартоватьПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьДанныеДляПредпросмотраФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляИсполнителейДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляОбработкиОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляПунктаДействияИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформироватьПроцессДляРассматривающегоДействияИсполнения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ДиспетчерОбработкиОчередиЗаданийКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ВыполнениеЗаданийНаКлиенте

// Обработает одно задание на клиенте и запишет результат
// 
// Параметры:
// 	ОписаниеЗадания - Структура
// 	 *Задание
// 	 *Тип
// 	 *Задание
// 	 *ПредметЗадания
//  ЗаданиеЗавершено - Булево	 
// 	
Процедура ОбработатьОдноЗадание(ОписаниеЗадания, ЗаданиеЗавершено) Экспорт
	
	РеквизитыЗадания = Новый Структура("Ссылка, Тип, ПредметЗадания, Родитель",
		ОписаниеЗадания.Задание, ОписаниеЗадания.Тип, ОписаниеЗадания.ПредметЗадания, ОписаниеЗадания.Родитель);
	АктуальностьЗадания = ОбработкаОчередиЗаданийВызовСервера.АктуальностьЗадания(РеквизитыЗадания);
	
	Если Не АктуальностьЗадания.Актуально Тогда
		
		РезультатВыполнения = Новый Структура("ЗаданиеЗавершено, ЗаписьЛога",
			Истина,
			СтрШаблон(НСтр("ru = 'Задание завершено. %1'"), АктуальностьЗадания.Пояснение));
		
	ИначеЕсли ОписаниеЗадания.Тип = ПредопределенноеЗначение("Перечисление.ТипыЗаданий.СоздатьHtmlПриНачалеСогласования") Тогда
		
		РезультатВыполнения 
			= ОбработкаОчередиЗаданийКлиент.ОбработатьСоздатьHtmlПриНачалеСогласования(
				ОписаниеЗадания);
		
	ИначеЕсли ОписаниеЗадания.Тип = ПредопределенноеЗначение("Перечисление.ТипыЗаданий.ОбновитьHtmlПередОзнакомлением") Тогда
		
		РезультатВыполнения 
			= ОбработкаОчередиЗаданийКлиент.ОбработатьОбновитьHtmlПередОзнакомлением(
				ОписаниеЗадания);

	ИначеЕсли ОписаниеЗадания.Тип = ПредопределенноеЗначение("Перечисление.ТипыЗаданий.ЗавершениеОзнакомленияСогласования") Тогда
		
		РезультатВыполнения 
			= ОбработкаОчередиЗаданийКлиент.ОбработатьЗавершениеОзнакомленияСогласования(
				ОписаниеЗадания);
				
	ИначеЕсли ОписаниеЗадания.Тип = ПредопределенноеЗначение("Перечисление.ТипыЗаданий.СформироватьДанныеДляПредпросмотраФайла") Тогда
		
		РезультатВыполнения 
			= ОбработкаОчередиЗаданийКлиент.СформироватьДанныеДляПредпросмотраФайла(
				ОписаниеЗадания);
				
	КонецЕсли;
	
	ЗаданиеЗавершено = РезультатВыполнения.ЗаданиеЗавершено;
	
	ДиспетчерОбработкиОчередиЗаданийВызовСервера.ОтработатьРезультатВыполнения(
		ОписаниеЗадания.Задание, РезультатВыполнения, ОписаниеЗадания.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
